{
    "catalog":
    [
    {
        "id": 201,
        "title": "Research Design and Applications for Data and Analysis",
        "units": 3,
        "instructor": "Michael Rivera",
        "description": "This course introduces students to the data sciences landscape, focusing on learning how to apply data science techniques to uncover, enrich, and answer the questions you will encounter and originate in the industry. After an introduction to data science and an overview of the course, students will explore decision-making in organizations and big data’s emerging role in guiding tactical and strategic decisions. Lectures, readings, discussions, and assignments will teach how to apply disciplined, creative methods to ask better questions, gather data, interpret results, and convey findings to various audiences in ways that change minds and behaviors.",
        "semester": ["Fall 2025", "Spring 2026"],
        "timeslot": ["Tuesday, 5:00pm - 6:30pm", "Wednesday, 10:30am - 12:00pm"],
        "location": ["Physics Building 2", "Internet/Online"],
        "type": "Non-Core",
        "requirements": "Social Science and Policy",
        "DS-certification": "Introductory Data Science Course",
        "topics": ["Data Science", "Statistics", "Data Visualization"],
        "other": "The Fall 2025 offering of this course will be in-person and the Spring 2026 offering will be online."
    },
    {
        "id": 202,
        "title": "Information Organization and Retrieval",
        "units": 3,
        "instructor": "Marti Hearst",
        "description": "15 weeks; 3 hours of lecture per week. This course introduces the intellectual foundations of information organization and retrieval: conceptual modeling, semantic representation, vocabulary and metadata design, classification, and standardization, as well as information retrieval practices, technology, and applications, including computational processes for analyzing information in both textual and non-textual formats.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 2:00pm - 3:30pm",
        "location": "Joan and Sanford I. Weill Hall 101",
        "type": "Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Information Organization", "Information Retrieval"],
        "other": null
    },
    {
        "id": "206A",
        "title": "Introduction to Programming and Computation",
        "units": 2,
        "instructor": "Hany Farid",
        "description": "7.5 weeks; 4 hours of lecture per week. This course introduces the basics of computer programming that are essential for those interested in computer science, data science, and information management. Students will write their own interactive programs (in Python) to analyze data, process text, draw graphics, manipulate images, and simulate physical systems. Problem decomposition, program efficiency, and good programming style are emphasized throughout the course.",
        "semester": "Fall 2025",
        "timeslot": "Monday & Wednesday, 2:00pm - 4:00pm",
        "location": "Joan and Sanford I. Weill Hall 101",
        "type": "Core",
        "requirements": null, 
        "DS-certification": null,
        "topics": ["Programming", "Python"],
        "other": null
    },
    {
        "id": "206B",
        "title": "Introduction to Data Structures and Analytics",
        "units": 2,
        "instructor": "Hany Farid",
        "description": "The ability to represent, manipulate, and analyze structured data sets is foundational to the modern practice of data science. This course introduces students to the fundamentals of data structures and data analysis (in Python). Best practices for writing code are emphasized throughout the course. This course forms the second half of a sequence that begins with INFO 206A. It may also be taken as a stand-alone course by any student that has sufficient Python experience.",
        "semester": "Fall 2025",
        "timeslot": "Monday & Wednesday, 2:00pm - 4:00pm",
        "location": "Joan and Sanford I. Weill Hall 101",
        "type": "Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Programming", "Data Science", "Data Visualization"],
        "other": null
    },
    {
        "id": 213,
        "title": "Introduction to User Experience Design",
        "units": 4,
        "instructor": "Stefanie Hutka",
        "description": "In this course, students will learn how to design technologies that work well and meet the needs of their users, how to communicate and defend your design decisions, and how human-centered design fits into the broader product development lifecycle. Students are introduced to the field of human-computer interaction (HCI) and build a strong foundation in user experience (UX) design. This course is designed to help students understand how design fits within the product development lifecycle and to practice key skills you’ll need as a UX practitioner in industry.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 9:30am - 11:00am",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": "Elective",
        "topics": ["Product Development", "User Experience (UX) Design", "Human-Computer Interaction"],
        "other": "Thanks for your interest in Info 213. Since this is a graduate level class in the School of Information, there's only space for a select number of undergraduates and students from other departments. If interested in enrolling in this course, fill out this form to express interest in enrolling in this course - https://forms.gle/e4EhQPbjy3LSyXU58 The deadline to submit the application form is Friday, July 25. Candidates who submitted the form will receive notification if enrolled by Friday, August 15. If you do not receive any communication about enrollment by this date, you will not be enrolled in INFO 213."
    },
    {
        "id": 225,
        "title": "Foundations of Leadership and Influence in Tech",
        "units": 3,
        "instructor": "Judd Antin",
        "description": "Succeeding in today’s distributed, technology-rich companies demands effectively leading and influencing others. This dynamic, interactive course is designed for ambitious professionals who are looking to have an impact, whether just starting out or already managing teams. Drawing heavily from social psychology and organizational behavior, this course goes beyond theory to develop real-world approaches. Students will engage with case studies and hands-on exercises to build the practical, research-backed skills needed to drive business impact with leadership and influence. A key focus is understanding workplace hierarchies and social dynamics, equipping students to thrive in complex, organizations — whether in tech or beyond.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday, 4:00pm - 7:00pm",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Leadership", "Business", "Social Psychology"],
        "other": null
    },
    {
        "id": 239,
        "title": "Technology and Delegation",
        "units": 3,
        "instructor": "Deirdre Mulligan",
        "description": "The introduction of technology increasingly delegates responsibility to technical actors, often reducing traditional forms of transparency and challenging traditional methods for accountability. This course explores the interaction between technical design and values including: privacy, accessibility, fairness, and freedom of expression. We will draw on literature from design, science and technology studies, computer science, law, and ethics, as well as primary sources in policy, standards and source code. We will investigate approaches to identifying the value implications of technical designs and use methods and tools for intentionally building in values at the outset.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday, 3:30pm - 6:30pm",
        "location": "South Hall 205",
        "type": "Non-Core",
        "requirements": "Social Science and Policy",
        "DS-certification": null,
        "topics": ["Law and Policy", "Social Impact"],
        "other": null
    },
    {
        "id": 241,
        "title": "Experiments and Causal Inference",
        "units": 3,
        "instructor": "D. Alex Hughes",
        "description": "This course introduces students to experimentation in data science. Particular attention is paid to the formation of causal questions, and the design and analysis of experiments to provide answers to these questions. This topic has increased considerably in importance since 1995, as researchers have learned to think creatively about how to generate data in more scientific ways, and developments in information technology has facilitated the development of better data gathering.",
        "semester": "Fall 2025",
        "timeslot": "Thursday, 11:00am - 12:30pm",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": "Social Science and Policy",
        "DS-certification": "Elective",
        "topics": ["Data Science"],
        "other": null
    },
    {
        "id": "253A",
        "title": "Front-End Web Architecture",
        "units": 3,
        "instructor": "Kay Ashaolu",
        "description": "This course is a survey of technologies that power the user interfaces of web applications on a variety of devices today, including desktop, mobile, and tablet devices. This course will delve into some of the core front-end languages and frameworks (HTML/CSS/JavaScript/React/Redux), as well as the underlying technologies that enable web applications (HTTP, URI, JSON). The goal of this course is to provide an overview of the technical issues surrounding user interfaces powered by the web today, and to provide a solid and comprehensive perspective of the web’s constantly evolving landscape.",
        "semester": "Fall 2025",
        "timeslot": ["Monday, 9:00am - 11:00am", "Friday, 9:00am - 10:00am (Lab Section)"],
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": "Technology",
        "DS-certification": null,
        "topics": ["Programming", "HTML & CSS", "React"],
        "other": null
    },
    {
        "id": 256,
        "title": "Applied Natural Language Processing",
        "units": 3,
        "instructor": "David Bamman",
        "description": "Three hours of lecture per week. Letter grade to fulfill degree requirements. Prerequisites: Proficient programming in Python (programs of at least 200 lines of code), proficient with basic statistics and probabilities. This course examines the state-of-the-art in applied Natural Language Processing (also known as content analysis and language engineering), with an emphasis on how well existing algorithms perform and how they can be used (or not) in applications. Topics include part-of-speech tagging, shallow parsing, text classification, information extraction, incorporation of lexicons and ontologies into text analysis, and question answering. Students will apply and extend existing software tools to text-processing problems.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 3:30pm - 5:00pm",
        "location": "South Hall 202",
        "type": "Non-Core",
        "requirements": "Technology",
        "DS-certification": "Elective",
        "topics": ["Programming", "Natural Language Processing (NLP)"],
        "other": null
    },
    {
        "id": "C262",
        "title": "Theory and Practice of Tangible User Interfaces",
        "units": 4,
        "instructor": "Kimiko Ryokai",
        "description": "Students will receive no credit for C262 after taking 290 section 4. Three hours of lecture and one hour of laboratory per week. This course explores the theory and practice of Tangible User Interfaces, a new approach to Human Computer Interaction that focuses on the physical interaction with computational media. The topics covered in the course include theoretical framework, design examples, enabling technologies, and evaluation of Tangible User Interfaces. Students will design and develop experimental Tangible User Interfaces using physical computing prototyping tools and write a final project report. Also listed as New Media C262.",
        "semester": "Fall 2025",
        "timeslot": ["Monday & Wednesday, 10:00am - 11:30am", "Thursday, 9:00am - 10:00 am (Lab Section)"],
        "location": "South Hall 202",
        "type": "Non-Core",
        "requirements": "Technology",
        "DS-certification": null,
        "topics": ["Human-Computer Interaction", "User Interface (UI) Design"],
        "other": null
    },
    {
        "id": "271B",
        "title": "Quantitative Research Methods for Information Systems and Management",
        "units": 3,
        "instructor": "Coye Cheshire",
        "description": "Three hours of lecture per week. Introduction to many different types of quantitative research methods, with an emphasis on linking quantitative statistical techniques to real-world research methods. Introductory and intermediate topics include: defining research problems, theory testing, causal inference, probability and univariate statistics. Research design and methodology topics include: primary/secondary survey data analysis, experimental designs, and coding qualitative data for quantitative analysis. No prerequisites, though an introductory course in statistics is recommended.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 12:30pm - 2:00pm",
        "location": "South Hall 202",
        "type": "Non-Core",
        "requirements": "Social Science and Policy",
        "DS-certification": "Analytical Methods and Techniques of Data Science Course",
        "topics": ["Data Science", "Statistics"],
        "other": null
    },
    {
        "id": 272,
        "title": "Qualitative Research Methods for Information Systems and Management",
        "units": 3,
        "instructor": "Laith Ulaby",
        "description": "Three hours of lecture per week. Theory and practice of naturalistic inquiry. Grounded theory. Ethnographic methods including interviews, focus groups, naturalistic observation. Case studies. Analysis of qualitative data. Issues of validity and generalizability in qualitative research.",
        "semester": "Fall 2025",
        "timeslot": "Friday, 2:00pm - 5:00pm",
        "location": "South Hall 205",
        "type": "Non-Core",
        "requirements": "Social Science and Policy",
        "DS-certification": null,
        "topics": ["Data Science", "Research", "Social Impact"],
        "other": null
    },
    {
        "id": 289,
        "title": "Public Interest Cybersecurity: The Cybersecurity Clinic Practicum",
        "units": 3,
        "instructor": "Elijah Baucom",
        "description": "This course provides students with real-world experience assisting politically vulnerable organizations and persons around the world to develop and implement sound cybersecurity practices. In the classroom, students study basic theories and practices of digital security, intricacies of protecting largely under-resourced organizations, and tools needed to manage risk in complex political, sociological, legal, and ethical contexts. In the clinic, students work in teams supervised by Clinic staff to provide direct cybersecurity assistance to civil society organizations. We emphasize pragmatic, workable solutions that take into account the unique needs of each partner organization.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 12:30pm - 2:00pm",
        "location": "South Hall 205",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Cybersecurity", "Social Impact"],
        "other": "Enrollment into this course is by application ONLY. Please submit the online application to apply for course enrollment: https://ischool.berkeley.edu/cc-app"
    },
    {
        "id": 290,
        "title": "Cultural Analytics",
        "units": 3,
        "instructor": "Kent Chang",
        "description": "While often defined as “the computational study of culture”, cultural analytics might be best understood as a radical interdisciplinary experiment, one that seeks to understand cultures — socialties, histories, cognition, the literary — through empirical models and patterns, built on effective computational representations of relevant cultural constructs. This experiment calls for a unique skill set: one needs to be familiar with approaches in the interpretive humanities and computer/information science; one also needs to cultivate an interdisciplinary mindset: recognize and appreciate the affordances and limitations of both qualitative and quantitative traditions. This class is imagined as a possible point of departure for those who are so inclined.\\nAs such, this course is all about making connections: bridging the interpretive traditions of literary and cultural studies — which guide our critical engagement with texts and cultural artifacts — with computational methods, ranging from featurized classifiers to large language models. It pursues two complementary ends: students will develop interpretive strategies and critical vocabularies for cultural analysis, and, through hands-on practice grounded in engagement and experience with the text, they will learn to represent cultural data — whether text, image, audio, or video — and train machine learning models as algorithmic measuring devices to systematically characterize cultural phenomena of interest.\\nThis class welcomes a range of inclinations: maybe you know how to implement an RNN or Transformer from scratch but are curious whether those models can be used to study literature, culture, or something beyond positive or negative sentiments. Or, maybe you’ve experimented with off-the-shelf topic models or word embeddings to explore humanities questions and want to see how far you can take them.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 11:00am - 12:30pm",
        "location": "South Hall 205",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Programming", "Natural Language Processing (NLP)", "Anthropology"],
        "other": null
    },
    {
        "id": 290,
        "title": "Behavioral Science and Public Policy",
        "units": 3,
        "instructor": "Diag Davenport",
        "description": "Behavioral science applies psychological insights to economic and mathematical theories of decision making. In this class, we will discuss the recent theoretical and empirical advances made in the field. Being thoughtful about the role of psychology can lead to a greater understanding of how economic agents make decisions, how the economy works, and how policy decisions will affect people. This course will utilize lectures, discussion, group interactions, and problem sets to provide an introduction to the topic of behavioral science. The primary goal of the class is to provide knowledge about the field and begin to explore how the topic might impact policy decisions in various contexts.",
        "semester": "Fall 2025",
        "timeslot": "Thursday, 2:00pm - 5:00pm",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Psychology", "Social Impact"],
        "other": null
    },
    {
        "id": 290,
        "title": "Storytelling for Your UX Portfolio",
        "units": 2,
        "instructor": "Mischelle Mulia",
        "description": "How do you create a concise and compelling User Experience portfolio? Applying the principles of effective storytelling to make a complex project quickly comprehensible is key. Your portfolio case studies should articulate the initial problem, synopsize the design process, explain the key decisions that moved the project forward, and highlight why the solution was appropriate. This course will include talks by several UX hiring managers who will discuss what they look for in portfolios and common mistakes to avoid.\\nStudents should come to the course with a completed project to use as the basis for their case study; they will finish with a completed case study and repeatable process. Although this class focuses on UX, students from related fields who are expected to share examples and outcomes of past projects during the interview process (data science, product management, etc.) are welcome to join.",
        "semester": "Fall 2025",
        "timeslot": "Thursday, 6:00pm - 8:30pm",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["User Experience (UX) Design"],
        "other": null
    },
    {
        "id": 290,
        "title": "Tech Policy Practicum",
        "units": 2,
        "instructor": "Deirdre Mulligan",
        "description": "This course is designed to help graduate students understand the various roles technical and data professionals play in policy development and enforcement primarily in the public and civil society sectors. The course is a mixture of independent work with outside experts, invited talks from tech and data experts from government and civil society organizations, and readings.",
        "semester": "Fall 2025",
        "timeslot": null,
        "location": null,
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Social Impact", "Law and Policy"],
        "other": null
    },
    {
        "id": 290,
        "title": "Climate, People, and Informatics",
        "units": 3,
        "instructor": "John Chuang",
        "description": "Peoples and communities around the world will be confronting the challenges of climate change, ecosystem degradation, and biodiversity loss for many decades to come. This course will explore the different ways in which the informatics and computing field can contribute to our individual and collective efforts to mitigate and adapt to the effects of climate change.\\nThrough readings and discussions, students will critically engage with foundational and leading-edge perspectives on diverse topics such as systems thinking for sustainability, sustainability in/through computing, fighting climate misinformation and climate anxiety, as well as how knowledge and tools from the fields of machine learning, human-computer interaction, remote sensing, speculative design, etc., are being applied to novel solutions in many different settings.\\nStudent-led projects will research the information needs and information seeking behaviors of individuals and communities, both now and into the future, and design information tools and resources to support them in their efforts of climate mitigation, adaptation, advocacy, and education.",
        "semester": "Fall 2025",
        "timeslot": "Monday & Wednesday, 4:00pm - 5:30pm", 
        "location": "South Hall 205",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Environmental Science", "Social Impact"],
        "other": null
    },
    {
        "id": 290,
        "title": "Knowledge Representation for Intelligent Applications",
        "units": 3,
        "instructor": "Frank Coyle",
        "description": "This course explores the theory and practice of building knowledge graphs from unstructured text, equipping students to develop AI-powered systems that can reason with structured information. The course progresses from foundational concepts in knowledge representation and language models to advanced techniques in entity extraction, knowledge graph construction, and semantic web technologies. Students will learn to enhance applications with graph-based retrieval augmented generation (GraphRAG), create effective visualizations, and fine-tune models for domain-specific knowledge needs. Designed to be accessible for those with minimal coding experience, the curriculum emphasizes hands-on learning through Python labs, guided projects with real-world datasets, and a culminating final project that demonstrates practical application. Students will develop a critical understanding of interpretability and ethical considerations in knowledge-intensive AI systems.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday, 9:00am - 12:00pm",
        "location": "Internet/Online",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Programming", "Artificial Intelligence (AI)"],
        "other": "This course is for I School MIMS & PhD students only. NOTE: This course will have live online class sessions. Students are expected to be able attend the course online during the scheduled day/time. There may be a few in-person sessions where the instructor will be on campus but in-person attendance will not be required. Prerequisites: INFO 206A: Introduction to Programming Students should have a basic knowledge of Python. Exercises will involve modifying program parameters and measuring performance for various datasets."
    },
    {
        "id": 290,
        "title": "Building Data Products for Public Impact",
        "units": 3,
        "instructor": "Diag Davenport",
        "description": "Public policy and civic organizations are increasingly guided by data products such as empirical graphs, statistical analyses, and machine learning predictions. However, no data product can deliver an absolute, unimpeachable truth. Therefore, building these products requires navigating a delicate balance between a) moving forward with identified issues and b) refining and improving the product to address issues. This class will help students develop their intuition for striking that balance through hands-on experience.",
        "semester": "Fall 2025",
        "timeslot": "Tuesday & Thursday, 12:30pm - 2:00pm",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Social Impact", "Law and Policy", "Product Development"],
        "other": "Students must have at least one semester of training in statistics, machine learning, or data science. To register, interested students must first email the instructor to arrange a brief meeting. This conversation will ensure that each student has the appropriate skills, interests, and understanding of the course’s collaborative and applied nature."
    },
    {
        "id": "290M",
        "title": "Lean/Agile Product Management",
        "units": 3,
        "instructor": "Elliott Adams",
        "description": "This course is designed to give participants a practical overview of the modern lean/agile product management paradigm based on contemporary industry practice. We cover the complete lifecycle of product management, from discovering your customers and users through to sales, marketing and managing teams. We'll take an experimental approach throughout, showing how to minimize investment and output while maximizing the information we discover in order to support effective decision-making. During the course, we'll show how to apply the theory through hands-on collaborative problem-solving activities. There will also be guest lectures from industry experts.",
        "semester": "Fall 2025",
        "timeslot": "Monday, 11:00am - 2:00pm",
        "location": "South Hall 210",
        "type": "Non-Core",
        "requirements": null,
        "DS-certification": null,
        "topics": ["Product Development", "Product Management"],
        "other": null
    }
    {
        "id": 
        "title":
        "units": 
        "instructor": 
        "description": 
        "semester": 
        "timeslot": 
        "location": 
        "type": 
        "requirements":
        "DS-certification":
        "topics":
        "other": 
    }
    ]   
}